<script setup>

</script>

<template>
  <div class="agreement">
    <h1 class="agreement__title">Политика Конфиденциальности</h1>
    <div class="agreement__content">
      <p>Добро пожаловать на страницу Политики Конфиденциальности [название вашего сервиса] (далее - "Сервис"). Мы ценим ваше доверие и стремимся обеспечить максимальную защиту ваших личных данных. Пожалуйста, внимательно ознакомьтесь с этой Политикой, чтобы полностью понять, как мы собираем, используем и защищаем вашу личную информацию.</p>
      <hr>
      <h2>1. Область Применения</h2>
      <p>Эта Политика Конфиденциальности применяется к всем данным, которые мы собираем от пользователей нашего Сервиса.</p>
      <h2>2. Согласие с Условиями</h2>
      <p>Используя наш Сервис, вы соглашаетесь с условиями нашей Политики Конфиденциальности. Если вы не согласны с этими условиями, пожалуйста, не используйте наш Сервис.</p>
      <h2>3. Обновления Политики</h2>
      <p>Мы можем периодически обновлять эту Политику Конфиденциальности. В случае внесения изменений мы оповестим вас об этом путем публикации обновленной версии на этой странице. Мы рекомендуем вам регулярно проверять эту страницу для получения последних обновлений.</p>
      <h2>4. Сбор Информации</h2>
      <p>Мы собираем различные типы информации для обеспечения функционирования и улучшения нашего Сервиса. Это включает в себя:</p>
      <ul>
        <li>Информация, которую вы предоставляете нам напрямую при регистрации или заполнении форм на Сервисе.</li>
        <li>Автоматически собираемую информацию, такую как данные о вашем устройстве, IP-адресе, использовании Сервиса и т.д.</li>
        <li>Куки и аналогичные технологии для сбора информации и улучшения пользовательского опыта.</li>
      </ul>
      <h2>5. Использование Информации</h2>
      <p>Собранная нами информация используется для предоставления и улучшения нашего Сервиса, обеспечения безопасности и защиты наших пользователей, а также для различных аналитических и рекламных целей.</p>
      <h2>6. Обмен Информацией</h2>
      <p>Мы не продаем, не арендуем и не передаем вашу личную информацию третьим лицам без вашего согласия, за исключением случаев, описанных в настоящей Политике.</p>
    </div>
    <div class="agreement__buttons">
      <button class="btn btn--gray">Кнопка 1</button>
      <button class="btn btn--primary">Кнопка 2</button>
    </div>
  </div>
</template>

<style scoped lang="scss">
h2:not(:first-child) {
  margin-top: rem(24);
}

.agreement {
  max-width: rem(800);
  padding: rem(32);
  border-radius: rem(24);
  background: rgba(255, 255, 255, 0.12);
  box-shadow: -20px 20px 60px -16px rgba(24, 24, 41, 0.52);
  backdrop-filter: blur(20px);

  &__content {
    margin-top: rem(32);
  }

  &__buttons {
    margin-top: rem(32);
    display: flex;
    align-items: center;
    gap: rem(32);

    .btn {
      width: 50%;
    }
  }


  h2 {
    font-size: rem(20);
    font-weight: 700;
  }

  * + p {
    margin-top: rem(8);
  }

  color: #E9EAEC;
  font-size: rem(18);
  font-weight: 500;
  line-height: 160%; /* 28.8px */

  ul {
    padding-left: rem(18);

    li {
      list-style: disc;

    }
  }

  &__title {
    font-size: rem(32);
    font-weight: 800;
    line-height: 132%; /* 42.24px */
  }
}
</style>
